// ── config.js ──────────────────────────────────────────────
const CONFIG = {
    ANGLE_LIMIT: 5,
    // レベル別問題プール
// レベル別問題プール
    LEVELS: {
        1: [
            "ついき", "きんし", "てんし", "りくつ", "さこく", 
            "めくる", "しんり", "ぬめり", "へしこ"
        ],
        2: [
            "しきてん", "こくさい", "りんしつ", "さくいん", "いんてり", 
            "きしめん", "しんちく", "くりぬき", "いんちき", "ぬきさし", 
            "へりくつ", "めいしん", "へいきん"
        ],
        3: [
            "しんりてき", "いんさつき", "しんきろく", "りろんてき", "りくつぬき"
        ]
    },
    // 各レベルから何問出すか
    COUNTS: {
        1: 2, // レベル1から2問
        2: 3, // レベル2から3問
        3: 1  // レベル3から1問
    },
    CHARS: {
       0: "さ", 1: "ち", 2: "い", 3: "こ", 4: "く",
        5: "へ", 6: "し", 7: "つ", 8: "て", 9: "り",
        10: "ん", 11: "ろ", 12: "る", 13: "め", 14: "ぬ", 15: "き"
    }
};